AustinHackers/ahabadge/KSDK_1.2.0/platform/hal/src/sim/MKV43F15/fsl_sim_hal_MKV43F15.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC6_FTM0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC6_FTM1(base);
        break;
    case 2:
        retValue =  false;
        break;    
    case 3:
        retValue =  SIM_BRD_SCGC6_FTM3(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcxMuxSelChannely
 * Description   : ADC x (0-A, 1-B)channel y (6,7) Mux.
 * Refer to RM for specific channel settings        
 * Selects ADCx MUX0's channel to ADCx channel y.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcxMuxSelChannely(SIM_Type* base, uint32_t instance, 
                                   uint8_t channel, uint8_t select)
{
  assert (instance<2);
  assert (channel<8);
  assert (channel>5);
    switch(instance)
    {
    case 0:
      switch(channel)
          {
          case 6:
            SIM_BWR_ADCOPT_ADCACH6SEL(base, select);
            break;
          case 7:
            SIM_BWR_ADCOPT_ADCACH7SEL(base, select);
            break;   
          default:
            break;
          }
          break;
    case 1:
      switch(channel)
          {
          case 6:
            SIM_BWR_ADCOPT_ADCBCH6SEL(base, select);
            break;
          case 7:
            SIM_BWR_ADCOPT_ADCBCH7SEL(base, select);
            break;  
          default:
            break;
          }
          break;
    default:
      break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmChOutSrcMode
 * Description   : Get FlexTimer x channel y output source select setting
 * This function will get FlexTimer x channel y output source select
 * setting.
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetAdcxMuxSelChannely(SIM_Type* base, uint32_t instance, uint8_t channel)
{
  assert (instance<2);
  assert (channel<8);
  assert (channel>5);
  uint8_t retValue = (uint8_t) false;
  switch(instance)
    {
    case 0:
      switch(channel)
          {
          case 6:
            retValue = (uint8_t)SIM_BRD_ADCOPT_ADCACH6SEL(base);
            break;
          case 7:
            retValue = (uint8_t)SIM_BRD_ADCOPT_ADCACH7SEL(base);
            break;  
          default:
            retValue = (uint8_t) false;
            break;
          }
          break;
    case 3:
      switch(channel)
          {
          case 6:
            retValue = (uint8_t)SIM_BRD_ADCOPT_ADCBCH6SEL(base);
            break;
          case 7:
            retValue = (uint8_t)SIM_BRD_ADCOPT_ADCBCH7SEL(base);
            break;  
          default:
            retValue = (uint8_t) false;
            break;
          }
          break;
    default:
      retValue = (uint8_t) false;
      break;
    }
  return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetNanoedgeRegulator12SupStdbyControl
 * Description   : Nanoedge Regulator 1.2 V Supply Standby Control
 * This function controls the standby mode of the 1.2 V supply from the nanoedge voltage regulator.
 * 00 Nanoedge regulator 1.2 V supply placed in normal mode
 * 01 Nanoedge regulator 1.2 V supply placed in standby mode.
 * 10 Nanoedge regulator 1.2 V supply placed in normal mode and SR12STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 1.2 V supply placed in standby mode and SR12STDBY is write protected until
 * chip reset.
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeRegulator12SupStdbyControl(SIM_Type* base, uint8_t select)
{
   assert (select < 4);
   SIM_BWR_PWRC_SR12STDBY(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetNanoedgeRegulator12SupStdbyControl
 * Description   : Get Nanoedge Regulator 1.2 V Supply Standby Control
 * This function will get the standby mode of the 1.2 V supply from the nanoedge voltage regulator
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeRegulator12SupStdbyControl(SIM_Type* base)
{
    return (uint8_t)SIM_BRD_PWRC_SR12STDBY(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetNanoedgeRegulator27SupStdbyControl
 * Description   : Nanoedge Regulator 2.7 V Supply Standby Control
 * This function controls the standby mode of the 2.7 V supply from the nanoedge voltage regulator.
 * 00 Nanoedge regulator 2.7 V supply placed in normal mode
 * 01 Nanoedge regulator 2.7 V supply placed in standby mode.
 * 10 Nanoedge regulator 2.7 V supply placed in normal mode and SR27STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 2.7 V supply placed in standby mode and SR27STDBY is write protected until
 * chip reset.
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeRegulator27SupStdbyControl(SIM_Type* base, uint8_t select)
{
   assert (select < 4);
   SIM_BWR_PWRC_SR12STDBY(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetNanoedgeRegulator27SupStdbyControl
 * Description   : Get Nanoedge Regulator 2.7 V Supply Standby Control
 * This function will get the standby mode of the 2.7 V supply from the nanoedge voltage regulator
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeRegulator27SupStdbyControl(SIM_Type* base)
{
    return (uint8_t)SIM_BRD_PWRC_SR12STDBY(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetNanoedgeReg27n12SupPwrdwnControl
 * Description   : Nanoedge Regulator 2.7V and 1.2V Supply Powerdown Control
 * This function controls the powerdown mode of the 2.7V and 1.2V supply from the nanoedge voltage regulator
 * 00 Nanoedge regulator placed in normal mode.
 * 01 Nanoedge regulator placed in powerdown mode.
 * 10 Nanoedge regulator placed in normal mode and SRPDN is write protected until chip reset.
 * 11 Nanoedge regulator placed in powerdown mode and SRPDN is write protected until chip reset.
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeReg27n12SupPwrdwnControl(SIM_Type* base, uint8_t select)
{
   assert (select < 4);
   SIM_BWR_PWRC_SRPDN(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetNanoedgeReg27n12SupPwrdwnControl
 * Description   : Get Nanoedge Regulator 2.7 V Supply Standby Control
 * This function will get the standby mode of the 2.7 V supply from the nanoedge voltage regulator
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeReg27n12SupPwrdwnControl(SIM_Type* base)
{
    return (uint8_t)SIM_BRD_PWRC_SRPDN(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetWdogClkSrc
 * Description   : WDOG Clock Select
 * This function selects the clock source of the WDOG2008 watchdog.
 * 0 Internal 1 kHz clock is source to WDOG2008
 * 1 MCGIRCLK is source to WDOG2008
 *
 *END**************************************************************************/
void SIM_HAL_SetWdogClkSrc(SIM_Type* base, bool select)
{
        SIM_BWR_WDOGC_WDOGCLKS(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetWdogClkSrc
 * Description   : Get WDOG Clock setting
 * This function will get the clock source of the WDOG2008 watchdog
 *
 *END**************************************************************************/
bool SIM_HAL_GetWdogClkSrc(SIM_Type* base)
{
    return (bool)SIM_BRD_WDOGC_WDOGCLKS(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableSyncXbarAPittrigX
 * Description   : Synchronize XBARA's Input PIT Trigger X with fast clock
 * This function controls the synchronizer between PIT trigger X and XBARA's input.
 *
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarAPittrigX(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG0(base, 1);
        break;
    case 1:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG1(base, 1);
        break;
    case 2:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG2(base, 1);
        break;
    case 3:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG3(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableSyncXbarAPittrigX
 * Description   : Disable the synchronizer between PIT trigger X and XBARA's input
 * This function Disables the synchronizer between PIT trigger X and XBARA's input
 *
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarAPittrigX(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG0(base, 0);
        break;
    case 1:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG1(base, 0);
        break;
    case 2:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG2(base, 0);
        break;
    case 3:
        SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG3(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetSyncXbarAPittrigXcmd
 * Description   : Get the synchronizer cmd between PIT trigger X and XBARA's input
 *
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarAPittrigXcmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

