AustinHackers/ahabadge/KSDK_1.2.0/platform/hal/src/sim/MKV43F15/fsl_sim_hal_MKV43F15.c
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmChOutSrcMode
 * Description   : Get FlexTimer x channel y output source select setting
 * This function will get FlexTimer x channel y output source select
 * setting.
 *
 *END**************************************************************************/
sim_ftm_ch_out_src_t SIM_HAL_GetFtmChOutSrcMode(SIM_Type* base,
                                                uint32_t instance,
                                                uint8_t channel)
{
    return (sim_ftm_ch_out_src_t)0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmCarrierFreqCmd
 * Description   : Set FTMxCFSELBIT
 * This function sets FlexTimer x carrier frequency selection software configuration setting.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmCarrierFreqCmd(SIM_Type* base, uint32_t instance, bool ftmcarrierfreqsrc)
{

}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmCarrierFreqCmd
 * Description   : Get FlexTimer x carrier frequency selection software configuration setting.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFtmCarrierFreqCmd(SIM_Type* base, uint32_t instance)
{
    return true;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmSyncCmd
 * Description   : Set FTMxSYNCBIT
 * This function sets FlexTimer x hardware trigger 0 software synchronization.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmSyncCmd(SIM_Type* base, uint32_t instance, bool sync)
{

}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcAlternativeTriggerCmd
 * Description   : Set ADCx alternate trigger enable setting
 * This function will enable/disable alternative conversion triggers for ADCx.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcAlternativeTriggerCmd(SIM_Type* base,
                                         sim_cadc_conv_id_t convId,
                                         sim_adc_alt_trg_en enable)
{
    switch (convId)
    {
    case kSimCAdcConvA:
        SIM_BWR_SOPT7_ADCAALTTRGEN(base, enable);
        break;
    case kSimCAdcConvB:
        SIM_BWR_SOPT7_ADCBALTTRGEN(base, enable);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcAlternativeTriggerCmd
 * Description   : Get ADCx alternate trigger enable setting
 * This function will get ADCx alternate trigger enable setting.
 *
 *END**************************************************************************/
sim_adc_alt_trg_en SIM_HAL_GetAdcAlternativeTriggerCmd(SIM_Type* base, sim_cadc_conv_id_t convId)
{
    sim_adc_alt_trg_en retValue = (sim_adc_alt_trg_en)false;

    switch (convId)
    {
    case kSimCAdcConvA:
        retValue = (sim_adc_alt_trg_en)SIM_BRD_SOPT7_ADCAALTTRGEN(base);
        break;
    case kSimCAdcConvB:
        retValue = (sim_adc_alt_trg_en)SIM_BRD_SOPT7_ADCBALTTRGEN(base);
        break;
    default:
        retValue = (sim_adc_alt_trg_en)false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerMode
 * Description   : Set ADCx trigger select setting
 * This function will select the ADCx trigger source when alternative triggers
 * are enabled through ADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerMode(SIM_Type* base,
                               sim_cadc_conv_id_t convId,
                               sim_adc_trg_sel_t select)
{
    switch (convId)
    {
    case kSimCAdcConvA:
        SIM_BWR_SOPT7_ADCATRGSEL(base, select);
        break;
    case kSimCAdcConvB:
        SIM_BWR_SOPT7_ADCBTRGSEL(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcTriggerMode
 * Description   : Get ADCx trigger select setting
 * This function will get ADCx trigger select setting.
 *
 *END**************************************************************************/
sim_adc_trg_sel_t SIM_HAL_GetAdcTriggerMode(SIM_Type* base, sim_cadc_conv_id_t convId)
{
    sim_adc_trg_sel_t retValue = (sim_adc_trg_sel_t)0;
    
    switch (convId)
    {
    case kSimCAdcConvA:
        retValue = (sim_adc_trg_sel_t)SIM_BRD_SOPT7_ADCATRGSEL(base);
        break;
    case kSimCAdcConvB:
        retValue = (sim_adc_trg_sel_t)SIM_BRD_SOPT7_ADCBTRGSEL(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerModeOneStep
 * Description   : Set ADCx trigger setting.
 * This function sets ADC alternate trigger and trigger mode.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerModeOneStep(SIM_Type* base,
                                      sim_cadc_conv_id_t convId,
                                      bool    altTrigEn,
                                      sim_adc_trg_sel_t trigSel)
{
    switch (convId)
    {
        case kSimCAdcConvA:
            SIM_BWR_SOPT7_ADCAALTTRGEN(base, altTrigEn ? 1 : 0);
            break;
        case kSimCAdcConvB:
            SIM_BWR_SOPT7_ADCBALTTRGEN(base, altTrigEn ? 1 : 0);
            break;
    default:
        break;
    }

    if (altTrigEn)
    {
        switch (convId)
        {
            case kSimCAdcConvA:
                SIM_BWR_SOPT7_ADCATRGSEL(base, trigSel);
                break;
            case kSimCAdcConvB:
                SIM_BWR_SOPT7_ADCBTRGSEL(base, trigSel);
                break;
            default:
                break;
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartRxSrcMode
 * Description   : Set UARTx receive data source select setting
 * This function will select the source for the UART1 receive data.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartRxSrcMode(SIM_Type* base,
                              uint32_t instance,
                              sim_uart_rxsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

