AustinHackers/ahabadge/KSDK_1.2.0/platform/hal/src/sim/MKV43F15/fsl_sim_hal_MKV43F15.c
    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC4_eFlexPWM0(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC4_eFlexPWM1(base);
        break;
    case 2:
        retValue =  SIM_BRD_SCGC4_eFlexPWM2(base);
        break;
    case 3:
        retValue =  SIM_BRD_SCGC4_eFlexPWM3(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableAoiClock
 * Description   : Enable the clock for AOI module
 * This function enables the clock for AOI moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableAoiClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_AOI(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableAoiClock
 * Description   : Disable the clock for AOI module
 * This function disables the clock for AOI moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableAoiClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_AOI(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAoiGateCmd
 * Description   : Get the the clock gate state for AOI module
 * This function will get the clock gate state for AOI moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetAoiGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC5_AOI(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableXbarClock
 * Description   : Enable the clock for XBAR module
 * This function enables the clock for XBAR moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableXbarClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_XBARA(base, 1);
        break;
    case 1:
        SIM_BWR_SCGC5_XBARB(base, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableXbarClock
 * Description   : Disable the clock for XBAR module
 * This function disables the clock for XBAR moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableXbarClock(SIM_Type* base, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        SIM_BWR_SCGC5_XBARA(base, 0);
        break;
    case 1:
        SIM_BWR_SCGC5_XBARB(base, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetXbarGateCmd
 * Description   : Get the the clock gate state for XBAR module
 * This function will get the clock gate state for XBAR moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetXbarGateCmd(SIM_Type* base, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  SIM_BRD_SCGC5_XBARA(base);
        break;
    case 1:
        retValue =  SIM_BRD_SCGC5_XBARB(base);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableEncClock
 * Description   : Enable the clock for ENC module
 * This function enables the clock for ENC moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableEncClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_ENC(base, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableEncClock
 * Description   : Disable the clock for ENC module
 * This function disables the clock for ENC moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableEncClock(SIM_Type* base, uint32_t instance)
{
    SIM_BWR_SCGC5_ENC(base, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetEncGateCmd
 * Description   : Get the the clock gate state for ENC module
 * This function will get the clock gate state for ENC moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetEncGateCmd(SIM_Type* base, uint32_t instance)
{
    return SIM_BRD_SCGC5_ENC(base);
}
/*******************************************************************************
 * EOF
 ******************************************************************************/

